/*==============================================================================
  xxxxxx処理用ヘッダ [templete.h]
  
 -------------------------------------------------------------------------------
  << REVISION HISTORY >>
  2020/xx/xx        matekai
  Initial Release
  
==============================================================================*/

/*======================================
  二重インクルード防止
======================================*/
#ifndef PCCOM_H
#define PCCOM_H
#include "common.h"

/*======================================
  実体 or 外部参照切り替え
======================================*/
#ifdef PCCOM_EXTERN
#define Extern
#else
#define Extern extern
#endif

/*======================================
  define
======================================*/
#define PCCOM_MAX_RCVBUF  ( U16 )( 80U )


/*======================================
  typedef
======================================*/


/*======================================
  global argument
======================================*/


/*======================================
  function prototype
======================================*/
Extern void pccom_rcv_intr( void ) ;
Extern U16 pccom_rcv_get( U8 * ) ;
Extern void pccom_rcv_initram( void ) ;


#undef Extern
#endif /* ifndef hoge_H */
