/*==============================================================================
  xxxxxx処理用ヘッダ [templete.h]
  
 -------------------------------------------------------------------------------
  << REVISION HISTORY >>
  2020/xx/xx        matekai
  Initial Release
  
==============================================================================*/

/*======================================
  二重インクルード防止
======================================*/
#ifndef SYSTM_H
#define SYSTM_H
#include "common.h"

/*======================================
  実体 or 外部参照切り替え
======================================*/
#ifdef SYSTM_Extern
#define Extern
#else
#define Extern extern
#endif

/*======================================
  define
======================================*/


/*======================================
  typedef
======================================*/


/*======================================
  global argument
======================================*/


/*======================================
  function prototype
======================================*/
Extern void systm_intr( void ) ;
Extern U32 systm_getcnt( void ) ;
Extern void systm_clrcnt( void ) ;
Extern void systm_init_ram( void ) ;


#undef Extern
#endif /* ifndef hoge_H */
