/*==============================================================================
  STM32F4xx 汎用タイマ処理用ヘッダ [timer.h]
  
 -------------------------------------------------------------------------------
  << REVISION HISTORY >>
  2020/xx/xx        matekai
  Initial Release
  
==============================================================================*/

/*======================================
  二重インクルード防止
======================================*/
#ifndef TIMER_H
#define TIMER_H
#include "common.h"

/*======================================
  実体 or 外部参照切り替え
======================================*/
#ifdef TIMER_EXTERN
#define Extern
#else
#define Extern extern
#endif

/*======================================
  define
======================================*/


/*======================================
  typedef
======================================*/


/*======================================
  global argument
======================================*/


/*======================================
  function prototype
======================================*/
Extern void stm32_tim2_init( void ) ;
Extern void stm32_tim2_start( void ) ;
Extern void stm32_tim2_stop( void ) ;
Extern void stm32_tim2_clrint( void ) ;

#undef Extern
#endif /* ifndef hoge_H */
