/*==============================================================================
  STM32F4xx UART処理用ヘッダ [uart.h]
  
 -------------------------------------------------------------------------------
  << REVISION HISTORY >>
  2020/xx/xx        matekai
  Initial Release
  
==============================================================================*/

/*======================================
  二重インクルード防止
======================================*/
#ifndef UART_H
#define UART_H
#include "common.h"

/*======================================
  実体 or 外部参照切り替え
======================================*/
#ifdef UART_EXTERN
#define Extern
#else
#define Extern extern
#endif

/*======================================
  define
======================================*/


/*======================================
  typedef
======================================*/


/*======================================
  global argument
======================================*/


/*======================================
  function prototype
======================================*/
Extern void stm32_uart1_init( void ) ;
Extern U8 stm32_uart1_getrcv( U8 * ) ;
Extern U8 stm32_uart1_getrcvsts( void ) ;
Extern U8 stm32_uart1_send( U8 ) ;
Extern U8 stm32_uart1_getsendsts( void ) ;

#undef Extern
#endif /* ifndef hoge_H */
