/*==============================================================================
  PC間通信　送信処理 [pccom_send.c]
  
 -------------------------------------------------------------------------------
  << REVISION HISTORY >>
  2020/xx/xx        matekai
  Initial Release
  
==============================================================================*/

#define PCCOM_SEND_EXTERN

/*=====================================
  include
=====================================*/
#include "common.h"
#include "uart.h"
#include "pccom_send.h"


/*=====================================
  define
=====================================*/


/*=====================================
  typedef
=====================================*/


/*=====================================
  static argument
=====================================*/
static U8 send_buf[ PCCOM_MAX_SENDBUF ] ;
static U16 send_buf_end ;
static U16 next_send_pos ;
static U16 n_send_data ;

/*=====================================
  function prototype
=====================================*/


/*=====================================
  global function
=====================================*/

/*==============================================================================
  PC間通信　周期送信処理関数
  void pccom_send_cycle( void )
  
 -------------------------------------------------------------------------------
  << Usage >>
  [ IN ]
     なし
  
  [ OUT ]
     なし
  
==============================================================================*/
void pccom_send_cycle( void )
{
	U8 call_rslt ;

	/* 送信データあり？ */
	if( n_send_data > 0 )
	{
		/* 送信状態取得 */
		call_rslt = stm32_uart1_getsendsts( ) ;
		/* 戻り値 = TRUE(前データ送信完了)？ */
		if( call_rslt == U8_BOOL_TRUE )
		{
			call_rslt = stm32_uart1_send( send_buf[ next_send_pos ] ) ;
			/* 送信OK？ */
			if( call_rslt == U8_BOOL_TRUE )
			{
				/* 次回送信データポジション更新 */
				next_send_pos = ( next_send_pos + 1 ) % 256 ;
				/* 送信データ数デクリメント */
				n_send_data-- ;
			}
		}
	}
	return ;
}

/*==============================================================================
  PC間通信　送信データ設定処理関数
  U8 pccom_send_set( U8 *, U16 )

 -------------------------------------------------------------------------------
  << Usage >>
  [ IN ]
  Arg0: 送信データバッファへのポインタ
  Arg1: 送信データ数

  [ OUT ]
  TRUE: 送信データ設定OK / FALSE: 送信データ設定NG

==============================================================================*/
U8 pccom_send_set( U8 *data, U16 ndata )
{
	U8 ret = U8_BOOL_FALSE ;
	U16 i ;

	/* 引数がNULL？ */
	if( data == NULL_PTR )
	{
		/* do nothing */
	}
	else
	{
		/* 現在バッファに格納されているデータ数 + 今回送信データ数 < バッファサイズ？ */
		if( n_send_data + ndata <= PCCOM_MAX_SENDBUF )
		{
			/* 割り込み禁止にして、送信バッファにデータを格納する */
			DISABLE_INT ;
			for( i = 0 ; i < ndata ; i++ )
			{
				send_buf[ ( send_buf_end + i ) % 256 ] = data[ i ] ;
			}
			/* 送信データ次回格納先ポジション更新 */
			send_buf_end = ( send_buf_end + ndata ) % 256 ;
			/* 送信データ数更新 */
			n_send_data += ndata ;
			/* 割り込み再許可 */
			ENABLE_INT ;
			/* 戻り値 = TRUE */
			ret = U8_BOOL_TRUE ;
		}
	}
	return ret ;
}
/*==============================================================================
  PC間通信　入力許可符号送信処理
  U8 pccom_send_sig4input( U8 *, U16 )

 -------------------------------------------------------------------------------
  << Usage >>
  [ IN ]
     なし

  [ OUT ]
  TRUE: 送信データ設定OK / FALSE: 送信データ設定NG

==============================================================================*/
U8 pccom_send_sig4input( void )
{
	U8 ret ;
	/* 入力許可サインとして改行＋">>"を送信する */
	ret = pccom_send_set( "\r\n>>", 4 ) ;
	return ret ;
}

/*==============================================================================
  PC間通信　送信データ初期化処理関数
  void pccom_send_initram( void )

 -------------------------------------------------------------------------------
  << Usage >>
  [ IN ]
     なし
  [ OUT ]
     なし

==============================================================================*/
void pccom_send_initram( void )
{
	U16 i ;
	send_buf_end  = 0U ;
	next_send_pos = 0U ;
	n_send_data   = 0U ;

	for( i = 0 ; i < PCCOM_MAX_SENDBUF ; i++ )
	{
		send_buf[ i ] = 0 ;
	}
	return ;
}
/*=====================================
  local function
=====================================*/

/*==============================================================================
  xxxxxx処理関数
  void hoge( void )
  
 -------------------------------------------------------------------------------
  << Usage >>
  [ IN ]
  
  
  [ OUT ]
  
==============================================================================*/


