/*==============================================================================
  PC間通信 受信処理 [pccom_rcv.c]
  
 -------------------------------------------------------------------------------
  << REVISION HISTORY >>
  2020/xx/xx        matekai
  Initial Release
  
==============================================================================*/

#define PCCOM_EXTERN

/*=====================================
  include
=====================================*/
#include "common.h"
#include "uart.h"
#include "pccom_rcv.h"


/*=====================================
  define
=====================================*/

/*=====================================
  typedef
=====================================*/


/*=====================================
  static argument
=====================================*/
static U8 rcv_buf[ PCCOM_MAX_RCVBUF ] ;
static U16 n_rcvd ;

/*=====================================
  function prototype
=====================================*/


/*=====================================
  global function
=====================================*/

/*==============================================================================
  PC間通信 受信割り込み処理関数
  void pccom_rcv_intr( void )
  
 -------------------------------------------------------------------------------
  << Usage >>
  [ IN ]
     なし
  
  [ OUT ]
     なし
==============================================================================*/
void pccom_rcv_intr( void )
{
	U8 rcv_data ;
	U8 call_rslt ;

	/* 受信状態を取得 */
	call_rslt = stm32_uart1_getrcvsts( ) ;
	/* 戻り値 =TRUE(異常なし)？ */
	if( call_rslt == U8_BOOL_TRUE )
	{
		/* 受信データを取得 */
		call_rslt = stm32_uart1_getrcv( &rcv_data ) ;
		/* 戻り値 = TRUE(受信データあり)、かつ受信データ数 = BUF長未満？ */
		if( ( call_rslt == U8_BOOL_TRUE )
		 && ( n_rcvd < PCCOM_MAX_RCVBUF ) )
		{
			/* 受信バッファにデータ格納 */
			rcv_buf[ n_rcvd ] = rcv_data ;
			n_rcvd++ ;
		}
	}
	return ;
}

/*==============================================================================
  PC間通信 受信データ取得処理関数
  U16 pccom_rcv_get( U8 * )

 -------------------------------------------------------------------------------
  << Usage >>
  [ IN ]
     受信データ格納先へのポインタ

  [ OUT ]
     バッファへの格納データ数
==============================================================================*/
U16 pccom_rcv_get( U8 *data )
{
	U16 n_data, i ;

	/* 引数がNULL？ */
	if( data == NULL_PTR )
	{
		/* 何もできないので、受信データ数 = 0とする */
		n_data = 0 ;
	}
	else
	{
		/* 割り込み禁止にして、受信データの複製を行う */
		DISABLE_INT ;
		for( i = 0 ; i < n_rcvd ; i++ )
		{
			data[ i ] = rcv_buf[ i ] ;
		}
		/* 受信データ数複写 */
		n_data = n_rcvd ;
		/* 受信データ数を0に初期化 */
		n_rcvd = 0 ;
		/* 割り込み再許可 */
		ENABLE_INT ;
	}
	return n_data ;
}

/*==============================================================================
  PC間通信 受信 変数初期化処理関数
  void pccom_rcv_initram( void )

 -------------------------------------------------------------------------------
  << Usage >>
  [ IN ]
     なし
  [ OUT ]
     なし
==============================================================================*/
void pccom_rcv_initram( void )
{
	U16 i ;
	n_rcvd = 0 ;
	for( i = 0 ; i < PCCOM_MAX_RCVBUF ; i++ )
	{
		rcv_buf[ i ] = 0 ;
	}
	return ;
}
/*=====================================
  local function
=====================================*/



